Пансион83/src/Catalogs/Ресурсы/Ресурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ресурсы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ТипыРесурсов</owners>
  <attributes>
    <name>DescriptionTranslations</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>RoundTheClockOperation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ServicePackage</name>
    <type>
      <types>CatalogRef.ПакетыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Calendar</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <attributes>
    <name>RackRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfPersonsPerResource</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TemplateFolio</name>
    <type>
      <types>DocumentRef.СчетПроживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SortCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Photo</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeFrom</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimeTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShowNumberOfPersonsPerResource</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsBoardPlace</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ServicePackages</name>
    <attributes>
      <name>ServicePackage</name>
      <type>
        <types>CatalogRef.ПакетыУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Пансион83/src/InformationRegisters/ХарактеристикаРесурса/ХарактеристикаРесурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХарактеристикаРесурса</name>
  <resources>
    <name>ResourceCharacteristicValue</name>
    <type>
      <types>Characteristic.ВидыХарактеристикРесурсов</types>
    </type>
  </resources>
  <dimensions>
    <name>Resource</name>
    <type>
      <types>CatalogRef.Ресурсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ResourceCharacteristic</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыХарактеристикРесурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Пансион83/src/Catalogs/Календари/Календари.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Календари</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>RoundTheClock</name>
      <description>24*7*365</description>
    </items>
  </predefined>
  <attributes>
    <name>SortCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsPerPeriod</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Пансион83/src/Catalogs/Ресурсы/ObjectModule.bsl
//-----------------------------------------------------------------------------
Процедура pmFillAttributesWithDefaultValues() Экспорт
	// Current hotel
	If НЕ ЗначениеЗаполнено(Гостиница) Тогда
		Гостиница = ПараметрыСеанса.ТекущаяГостиница;
	EndIf;
	// Use round-the-clock calendar by default
	If НЕ ЗначениеЗаполнено(Calendar) Тогда
		Calendar = Справочники.Календари.RoundTheClock;
		RoundTheClockOperation = True;
	EndIf;
КонецПроцедуры //pmFillAttributesWithDefaultValues

//-----------------------------------------------------------------------------
Function pmCheckResourceAttributes(pMessage, pAttributeInErr) Экспорт
	vHasErrors = False;
	pMessage = "";
	pAttributeInErr = "";
	vMsgTextRu = "";
	vMsgTextEn = "";
	If IsBlankString(Code) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Код> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Code> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Code", pAttributeInErr);
	EndIf;
	If IsBlankString(Description) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Наименование> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Description> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Description", pAttributeInErr);
	EndIf;
	If НЕ ЗначениеЗаполнено(Owner) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Тип ресурса> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Ресурс type> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Owner", pAttributeInErr);
	EndIf;
	If НЕ ЗначениеЗаполнено(Calendar) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Календарь работы ресурса> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Ресурс working time calendar> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Calendar", pAttributeInErr);
	EndIf;
	If vHasErrors Тогда
		pMessage = "ru = '" + СокрЛП(vMsgTextRu) + "';" + "en = '" + СокрЛП(vMsgTextEn) + "';";
	EndIf;
	Return vHasErrors;
EndFunction //pmCheckResourceAttributes

//-----------------------------------------------------------------------------
Function pmGetResourceDescription(pLang) Экспорт
	vDescr = "";
	If НЕ ЗначениеЗаполнено(pLang) Тогда
		vDescr = СокрЛП(Description);
	Else
		If IsBlankString(DescriptionTranslations) Тогда
			vDescr = СокрЛП(Description);
		Else
			vDescr = СокрЛП(DescriptionTranslations);
		EndIf;
	EndIf;
	Return vDescr;
EndFunction //pmGetResourceDescription

//-----------------------------------------------------------------------------
// Get resource characteristics
// Returns ValueTable 
//-----------------------------------------------------------------------------
Function pmGetResourceCharacteristics() Экспорт
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	ResourceCharacteristics.Ресурс,
	|	ResourceCharacteristics.ResourceCharacteristic,
	|	ResourceCharacteristics.ResourceCharacteristicValue
	|FROM
	|	InformationRegister.ResourceCharacteristics AS ResourceCharacteristics
	|WHERE
	|	ResourceCharacteristics.Ресурс = &qResource AND
	|	ResourceCharacteristics.ResourceCharacteristic.DeletionMark = FALSE
	|ORDER BY
	|	ResourceCharacteristics.ResourceCharacteristic.Code";
	vQry.SetParameter("qResource", Ref);
	vChars = vQry.Execute().Unload();
	Return vChars;
EndFunction //pmGetResourceCharacteristics

//-----------------------------------------------------------------------------
// Get resource characteristic value
// Returns Value
//-----------------------------------------------------------------------------
Function pmGetResourceCharacteristicValue(pResourceCharacteristic) Экспорт
	vCharValue = Неопределено;
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	ResourceCharacteristics.ResourceCharacteristicValue
	|FROM
	|	InformationRegister.ResourceCharacteristics AS ResourceCharacteristics
	|WHERE
	|	ResourceCharacteristics.Ресурс = &qResource AND
	|	ResourceCharacteristics.ResourceCharacteristic = &qResourceCharacteristic
	|ORDER BY
	|	ResourceCharacteristics.ResourceCharacteristic.Code";
	vQry.SetParameter("qResource", Ref);
	vQry.SetParameter("qResourceCharacteristic", pResourceCharacteristic);
	vChars = vQry.Execute().Choose();
	While vChars.Next() Do
		vCharValue = vChars.ResourceCharacteristicValue;
		Break;
	EndDo;
	Return vCharValue;
EndFunction //pmGetResourceCharacteristicValue

//-----------------------------------------------------------------------------
Процедура pmSaveResourceCharacteristicValue(pResourceCharacteristic, pResourceCharacteristicValue) Экспорт
	vResourceCharsMgr = InformationRegisters.ХарактеристикаРесурса.CreateRecordManager();
	vResourceCharsMgr.Ресурс = Ref;
	vResourceCharsMgr.ResourceCharacteristic = pResourceCharacteristic;
	vResourceCharsMgr.Read();
	If vResourceCharsMgr.Selected() Тогда
		vResourceCharsMgr.Ресурс = Ref;
		vResourceCharsMgr.ResourceCharacteristic = pResourceCharacteristic;
		vResourceCharsMgr.ResourceCharacteristicValue = pResourceCharacteristicValue;
		vResourceCharsMgr.Write();
	EndIf;
КонецПроцедуры //pmSaveResourceCharacteristicValue

//-----------------------------------------------------------------------------
// Get resource children
// Returns ValueTable
//-----------------------------------------------------------------------------
Function pmGetResourceChildren() Экспорт
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	Ресурсы.Ref AS Ресурс
	|FROM
	|	Catalog.Ресурсы AS Ресурсы
	|WHERE
	|	Ресурсы.Parent = &qResource
	|	AND (NOT Ресурсы.DeletionMark)
	|ORDER BY
	|	Ресурсы.ПорядокСортировки";
	vQry.SetParameter("qResource", Ref);
	vChildren = vQry.Execute().Unload();
	Return vChildren;
EndFunction //pmGetResourceChildren

//-----------------------------------------------------------------------------
// Get resource default charging time
// Returns Structure with TimeFrom and TimeTo elements
//-----------------------------------------------------------------------------
Function pmGetResourceDefaultChargingTimes(pAccountingDate) Экспорт
	// Check resource attributes
	If ЗначениеЗаполнено(TimeFrom) And ЗначениеЗаполнено(TimeTo) And TimeTo >= TimeFrom Тогда
		Return New Structure("ВремяС, ВремяПо", TimeFrom, TimeTo);
	EndIf;
	// Check calendar timetable
	If ЗначениеЗаполнено(Calendar) Тогда
		vCalendarObj = Calendar.GetObject();
		vDays = vCalendarObj.pmGetDays(BegOfDay(pAccountingDate), BegOfDay(pAccountingDate));
		If vDays.Count() > 0 Тогда
			vDaysRow = vDays.Get(0);
			vTimetable = vDaysRow.Timetable;
			If ЗначениеЗаполнено(vTimeTable) And vTimeTable.WorkingTimes.Count() > 0 Тогда
				vWorkingTimes = vTimeTable.WorkingTimes.Unload();
				vWorkingTimes.Sort("ВремяС");
				vTimeFrom = vWorkingTimes.Get(0).ВремяС;
				vTimeTo = vWorkingTimes.Get(vWorkingTimes.Count() - 1).ВремяПо;
				If ЗначениеЗаполнено(vTimeFrom) And ЗначениеЗаполнено(vTimeTo) And vTimeTo >= vTimeFrom Тогда
					Return New Structure("ВремяС, ВремяПо", vTimeFrom, vTimeTo);
				EndIf;
			EndIf;
		EndIf;
	EndIf;
	Return New Structure("ВремяС, ВремяПо", '00010101', '00010101');
EndFunction //pmGetResourceDefaultChargingTimes
